Revit 2026 API

# DirectShapeReferenceOptions(DirectShapeReferenceOptions) Constructor

---

Constructs a new copy of the input DirectShapeRefOptions object.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public DirectShapeReferenceOptions(
	DirectShapeReferenceOptions other
)
```
```vb
Public Sub New (
	other As DirectShapeReferenceOptions
)
```
```cpp
public:
DirectShapeReferenceOptions(
	DirectShapeReferenceOptions^ other
)
```
```fsharp
new :
        other : DirectShapeReferenceOptions -> DirectShapeReferenceOptions
```

#### Parameters

other DirectShapeReferenceOptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

DirectShapeReferenceOptions Class

DirectShapeReferenceOptions Overload

Autodesk.Revit.DB Namespace